app/Facades/Utility.php

    public function settings()
    {
        $data = DB::table('settings');
        $data = $data->get();
---
select * from `settings`

    public function getsettings($value = '')
    {
        $setting = Setting::select('value');
        if (!empty(tenant('id'))) {
            $setting->where('tenant_id', tenant('id'));
        } else {
            $setting->whereNull('tenant_id');
        }
        $set =  $setting->where('key', $value)->first();
---
select `value` from `settings` where `tenant_id` = '13' and `key` = 'app_name' and `settings`.`tenant_id` = '13' limit 1