app/Http/Controllers/Superadmin/HomeController.php

    public function chart(Request $request)
    {
        $arrLable   = [];
        $arrValue   = [];
        $startDate  = Carbon::parse($request->start);
        $endDate    = Carbon::parse($request->end);
        $monthsDiff = $endDate->diffInMonths($startDate);
        if ($monthsDiff >= 0 && $monthsDiff < 3) {
            $endDate    = $endDate->addDay();
            $interval   = CarbonInterval::day();
            $timeType   = "date";
            $dateFormat = "DATE_FORMAT(created_at, '%Y-%m-%d')";
        } elseif ($monthsDiff >= 3 && $monthsDiff < 12) {
            $interval   = CarbonInterval::month();
            $timeType   = "month";
            $dateFormat = "DATE_FORMAT(created_at, '%Y-%m')";
        } else {
            $interval   = CarbonInterval::year();
            $timeType   = "year";
            $dateFormat = "YEAR(created_at)";
        }

        $orderReaports  = Order::select(DB::raw($dateFormat . ' AS ' . $timeType . ',SUM(amount) AS totalAmount'))
            ->whereDate('created_at', '>=', $startDate)
            ->whereDate('created_at', '<=', $endDate)
            ->groupBy(DB::raw($dateFormat))
            ->get()
            ->toArray();
---
select DATE_FORMAT(created_at, '%Y-%m-%d') AS date,SUM(amount) AS totalAmount from `orders` where date(`created_at`) >= '2024-06-12' and date(`created_at`) <= '2024-06-18' group by DATE_FORMAT(created_at, '%Y-%m-%d')