app/Http/Controllers/Superadmin/PlanController.php

select * from `plans` where `plans`.`id` = '10' limit 1
select * from `users` where `plan_id` = 10 limit 1
---
    public function edit($id)
    {
        if (Auth::user()->can('edit-plan')) {
            $plan = Plan::find($id);
            // tenant database setting store
            $user = User::where('plan_id', $plan->id)->first();

select * from `plans` where `plans`.`id` = '3' limit 1
---
    public function update(Request $request, $id)
    {


        $vantagens = $request->vantagens;
        $vantagens = trim($vantagens, ' ');

        if (Auth::user()->can('edit-plan')) {
            request()->validate([
                'name'          => 'required|max:50|unique:plans,name,' . $id,
                'price'         => 'required',
                'duration'      => 'required',

                'description'   => 'max:191',
            ]);


            $plan = Plan::find($id);

select * from `users` where `plan_id` = '3' limit 1
---
            $plan->save();

            // tenant database setting store
            $users = User::where('plan_id', $id)->first();