app/Http/Controllers/Superadmin/RequestDomainController.php

select * from `testimonials` where `status` = 1
select * from `plans` where `active_status` = 1
select * from `faqs` order by `order` asc limit 4
select * from `footer_settings` where `parent_id` = 0
select * from `announcements` where `status` = '1' and `start_date` <= '2024-06-18' and `end_date` >= '2024-06-18' and `share_with_public` = '1'
select * from `announcements` where `status` = '1' and `start_date` <= '2024-06-18' and `end_date` >= '2024-06-18' and `show_landing_page_announcebar` = '1'
---
    public function landingPage()
    {
        $centralDomain     = config('tenancy.central_domains')[0];
        $currentDomain     = tenant('domains');
        if (!empty($currentDomain)) {
            $currentDomain = $currentDomain->pluck('domain')->toArray()[0];
        }
        if ($currentDomain == null) {
            if (!file_exists(storage_path() . "/installed")) {
                header('location:install');
                die;
            }
            $lang                           = UtilityFacades::getActiveLanguage();
            \App::setLocale($lang);
            $appsMultipleImageSettings      = json_decode(UtilityFacades::getsettings('apps_multiple_image_setting'));
            $features                       = json_decode(UtilityFacades::getsettings('feature_setting'));
            $businessGrowthsSettings        = json_decode(UtilityFacades::getsettings('business_growth_setting'));
            $businessGrowthsViewSettings    = json_decode(UtilityFacades::getsettings('business_growth_view_setting'));
            $testimonials                   = Testimonial::where('status', 1)->get();
            $plans                          = Plan::where('active_status', 1)->get();
            $faqs                           = Faq::orderBy('order')->take(4)->get();
            $footerMainMenus                = FooterSetting::where('parent_id', 0)->get();
            $currentDate = now()->toDateString();
            $announcementLists = Announcement::where('status', '1')
                ->where('start_date', '<=', $currentDate)
                ->where('end_date', '>=', $currentDate)
                ->where('share_with_public', '1')
                ->get();
            $announcementBars = Announcement::where('status', '1')
                ->where('start_date', '<=', $currentDate)
                ->where('end_date', '>=', $currentDate)
                ->where('show_landing_page_announcebar', '1')
                ->get();