app/Http/Controllers/Superadmin/UserController.php

select * from `users` where `users`.`id` = '5' limit 1
select * from `domains` where `tenant_id` = '5' limit 1
---
    public function update(Request $request, $id)
    {
        if (Auth::user()->can('edit-user')) {
            $user = User::find($id);
            $tenantId = Domain::where('tenant_id', $user->tenant_id)->first();
            if (UtilityFacades::getsettings('domain_config') == 'on') {
                $request->merge(['domains' => $request->domains . '.' . parse_url(env('APP_URL'), PHP_URL_HOST)]);
            }
            request()->validate([
                'name' => 'required|max:50',
                'email' => 'required|email|unique:users,email,' . $id,
                'domains' => 'required|max:50|unique:domains,domain,' . $tenantId->id,
                'phone' => 'required',
                'country_code' => 'required',
                'dial_code' => 'required',
            ]);
            $user = User::find($id);
            $user->name = $request->name;
            $user->email = $request->email;

            $user->plan_id = $request->plan_id;
            $user->country_code = $request->country_code;
            $user->dial_code = $request->dial_code;
            $user->plan_expired_date = $request->plan_expired_date;
            $user->phone = str_replace(' ', '', $request->phone);
            $user->save();
            $domain = Domain::where('tenant_id', $user->tenant_id)->first();

select * from `users` where `tenant_id` = '5' and `users`.`tenant_id` = '5' limit 1
---
                $domain->save();
            }
            tenancy()->initialize($user->tenant_id);
            $users = User::where('tenant_id', $user->tenant_id)->first();

select * from `plans` where `id` = '2' limit 1
---
            $users->save();
            tenancy()->end();

            $plan = Plan::where('id', $request->plan_id)->first();