app/Livewire/Adm.php

    public function mount(Request $request )
    {


        $this->path = $request->path();
        $this->id = $request->id;
        $this->product_id = $request->product_id;
        $this->title = $request->path();








        if (!isset($this->settings)) {
            include app_path('Includes/settings.php');
            $this->conn = $_settings->conn;
            $this->settings = $_settings;
        }


        $this->planos = tenancy()->central(function ($tenant) {
            return Plan::all();
        });

        $this->user = tenancy()->central(function ($tenant) {
            return User::find($tenant->id);
        });

        $this->user_plano = $this->user->plan_id;

        $this->user = tenancy()->central(function ($tenant) {
            return User::find($tenant->id);
        });
---
select * from `plans`
select * from `users` where `users`.`id` = '6' limit 1
select * from `users` where `users`.`id` = '13' limit 1