app/Http/Controllers/Admin/HomeController.php

    public function readNotification()
    {
        $user   = User::where('tenant_id', tenant('id'))->first();
---
select * from `users` where `tenant_id` = '13' and `users`.`tenant_id` = '13' limit 1